#### Working with multiple tables
- Joins
- Intercept
- Except

In [2]:
%load_ext sql

%sql postgresql://postgres:Speedy3861@localhost:5432/sql-cookbook

#### 3.1 Stacking One Rowset atop Another

You want to return data stored in more than one table, conceptually stacking one result set atop the other. The tables do not necessarily have a common key, but their columns do have the same data types. For example, you want to display the name and department number of the employees in department 10 in table EMP, along with the name and department number of each department in table DEPT.

In [25]:
%%sql

select ename, deptno
from employees
where deptno = 10
Union all
select '-------------',null
Union all
select dname, deptno
from dept;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
8 rows affected.

[('CLARK', 10),
 ('KING', 10),
 ('MILLER', 10),
 ('-------------', None),
 ('ACCOUNTING', 10),
 ('RESEARCH', 20),
 ('SALES', 30),
 ('OPERATIONS', 40)]

##### Union All vs Union

- UNION ALL will include duplicates.
- UNION will excluse duplicates.

In [28]:
%%sql

select deptno
from employees
union
select deptno
from dept;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
4 rows affected.

[(40,), (10,), (30,), (20,)]

In [30]:
%%sql
select *
from(
select deptno
from employees
union all
select deptno
from dept) t
order by 1;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
18 rows affected.

[(10,),
 (10,),
 (10,),
 (10,),
 (20,),
 (20,),
 (20,),
 (20,),
 (20,),
 (20,),
 (30,),
 (30,),
 (30,),
 (30,),
 (30,),
 (30,),
 (30,),
 (40,)]

##### Difference between union and join

In [41]:
%%sql

select e.deptno
from employees e
left join dept d on 
e.deptno = d.deptno
order by 1;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(10,),
 (10,),
 (10,),
 (20,),
 (20,),
 (20,),
 (20,),
 (20,),
 (30,),
 (30,),
 (30,),
 (30,),
 (30,),
 (30,)]